Documents/СведенияОбИзмененииДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СведенияОбИзмененииДоговора</Name>
			<BasedOn>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыПоДоговорам</xr:Item>
				<xr:Item>AccumulationRegister.НачисленияПоГоспошлине</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоОбъектамВнесудебная</xr:Item>
				<xr:Item>AccumulationRegister.ИсковыеТребования</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоСудебнымРешениям</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоОбъектам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИзменения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НБКИ_ТипыИзмененияДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИзменияДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЛьготногоПериода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричиныУрегулированияПроблемнойЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыПрочихИзмененийДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеИныхИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВступленияИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлановогоПрекращенияИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоПрекращенияИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричиныПрекращенияДействийИзмененияДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричиныПрекращенияОбязательства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПрекращенияОбязательства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДелоОНедееспособностиСубъекта</v8:Type>
						<v8:Type>cfg:DocumentRef.СудебноеДело</v8:Type>
						<v8:Type>cfg:CatalogRef.ДелоОБанкротстве</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнесудебноеБанкротствоДолжника</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеПрощение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписыватьЗадолженностьВПрограмме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументКорректировка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрекращенияОбязательства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наследник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/НБКИ_ТипыИзмененияДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>НБКИ_ТипыИзмененияДоговора</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОПрощении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МировоеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаследованиеДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаконодательныеИНормативноПравовыеАкты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредусмотреныИсходнымиУсловиями</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СведенияОбИзмененииДоговора/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	Если Не ЗначениеЗаполнено(Объект.ТипИзменения) Тогда
		Объект.ТипИзменения = Перечисления.НБКИ_ТипыИзмененияДоговора.Изменения;   
	КонецЕсли;
	ВидимостьЭлементов();   
КонецПроцедуры

&НаКлиенте
Процедура ПолноеПрощениеПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ВидимостьЭлементов()
	Элементы.ДокументКорректировка.Видимость = Объект.СписыватьЗадолженностьВПрограмме И Не Объект.ПолноеПрощение;  
	Элементы.ВидЛьготногоПериода.Видимость = (Объект.ВидИзменияДоговора = 1);
	Элементы.ПричиныУрегулированияПроблемнойЗадолженности.Видимость = (Объект.ВидИзменияДоговора = 2);
	Элементы.ВидыПрочихИзмененийДоговора.Видимость = (Объект.ВидИзменияДоговора = 3);
	Элементы.ОписаниеИныхИзменений.Видимость = (Объект.ПричиныУрегулированияПроблемнойЗадолженности = 99 или Объект.ВидыПрочихИзмененийДоговора = 99);
	Элементы.Наследник.Видимость = (Объект.ТипИзменения = Перечисления.НБКИ_ТипыИзмененияДоговора.НаследованиеДоговора);
КонецПроцедуры

&НаКлиенте
Процедура ВидИзменияДоговораПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПричиныУрегулированияПроблемнойЗадолженностиПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ВидыПрочихИзмененийДоговораПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ТипИзмененияПриИзменении(Элемент)
	//ЗаполнитьПараметрыНаследованияДоговора();
	ОбработатьТипыИзменения();
	ВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыНаследованияДоговора()
	Если Объект.ТипИзменения = Перечисления.НБКИ_ТипыИзмененияДоговора.НаследованиеДоговора Тогда
		Объект.ВидИзменияДоговора = 3;
		Объект.ВидыПрочихИзмененийДоговора = 99;
		Объект.ОписаниеИныхИзменений = "Вступление в наследство.";	
	Иначе
		Объект.ВидИзменияДоговора = "";
		Объект.ВидыПрочихИзмененийДоговора = "";
		Объект.ОписаниеИныхИзменений = "";
	КонецЕсли;	
КонецПроцедуры 

&НаСервере
Процедура ОбработатьТипыИзменения()
	Если Объект.ТипИзменения = Перечисления.НБКИ_ТипыИзмененияДоговора.НаследованиеДоговора Тогда
		Объект.ВидИзменияДоговора = 3;
		Объект.ВидыПрочихИзмененийДоговора = 99;  
		Объект.ПричиныУрегулированияПроблемнойЗадолженности = "";
		Объект.ОписаниеИныхИзменений = "Вступление в наследство.";	
	ИначеЕсли Объект.ТипИзменения = Перечисления.НБКИ_ТипыИзмененияДоговора.ЗаконодательныеИНормативноПравовыеАкты Тогда
		Объект.ВидИзменияДоговора = 2;
		Объект.ВидыПрочихИзмененийДоговора = "";
		Объект.ПричиныУрегулированияПроблемнойЗадолженности = 99;  
		Объект.ОписаниеИныхИзменений = "Укажите в этом поле причины изменения договора для события 2.1 или измените значение показателя Видов изменений. На основании акта органа государственной власти или органа местного самоуправления.";
		Объект.СписыватьЗадолженностьВПрограмме = Истина;
		Объект.ПолноеПрощение = Истина;
		Объект.ПричиныПрекращенияОбязательства = 13;
	ИначеЕсли Объект.ТипИзменения = Перечисления.НБКИ_ТипыИзмененияДоговора.ПредусмотреныИсходнымиУсловиями Тогда
		Объект.ВидИзменияДоговора = 3;
		Объект.ВидыПрочихИзмененийДоговора = "";
		Объект.ПричиныУрегулированияПроблемнойЗадолженности = "";  
		Объект.ОписаниеИныхИзменений = "Заполните данные, которые необходимы дя блоков ФЛ 23(1)/ ЮЛ 15(1)";
		Объект.СписыватьЗадолженностьВПрограмме = Ложь;
		Объект.ПолноеПрощение = Ложь;
		Объект.ПричиныПрекращенияОбязательства = "";
	
	Иначе
		Объект.ВидИзменияДоговора = "";     
		Объект.ВидыПрочихИзмененийДоговора = "";
		Объект.ПричиныУрегулированияПроблемнойЗадолженности = "";
		Объект.ОписаниеИныхИзменений = ""; 
		Объект.СписыватьЗадолженностьВПрограмме = Ложь;
		Объект.ПолноеПрощение = Ложь; 
		Объект.ПричиныПрекращенияОбязательства = "";
	КонецЕсли;	
КонецПроцедуры
 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьЭлементов();
КонецПроцедуры


&НаСервере
Процедура ОснованиеПрекращенияОбязательстваПриИзмененииНаСервере()
	Если ТипЗнч(Объект.ОснованиеПрекращенияОбязательства) = Тип("ДокументСсылка.СудебноеДело") Тогда
		Если Объект.ТипИзменения = Перечисления.НБКИ_ТипыИзмененияДоговора.МировоеСоглашение Тогда
			Объект.ПричиныПрекращенияОбязательства = 3;   
		ИначеЕсли Объект.ТипИзменения = Перечисления.НБКИ_ТипыИзмененияДоговора.СоглашениеОПрощении Тогда 
			Объект.ПричиныПрекращенияОбязательства = 11; 
		Иначе
			Объект.ПричиныПрекращенияОбязательства = 2;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Объект.ОснованиеПрекращенияОбязательства) = Тип("СправочникСсылка.ДелоОНедееспособностиСубъекта") Тогда
		Объект.ПричиныПрекращенияОбязательства = 13;
	ИначеЕсли ТипЗнч(Объект.ОснованиеПрекращенияОбязательства) = Тип("СправочникСсылка.ДелоОБанкротстве") Тогда
		Объект.ПричиныПрекращенияОбязательства = 16; 
	Иначе 
		Объект.ПричиныПрекращенияОбязательства = 99;
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ОснованиеПрекращенияОбязательстваПриИзменении(Элемент)
	ОснованиеПрекращенияОбязательстваПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура СписыватьЗадолженностьВПрограммеПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры
